# PANDAS

pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# create a pandas series
s = pd.Series([1, 3, 5, np.nan, 6, 7])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    7.0
dtype: float64

In [4]:
s.shape

(6,)

In [5]:
# create a range of dates, date provided is start date, periods increments by day
dates = pd.date_range('20130101', periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
# create a dataframe from random data using the dates variable created earlier as the index
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
print (df)

                   A         B         C         D
2013-01-01  0.816414  0.241281  1.259946  0.563317
2013-01-02 -1.004928  1.039068 -1.062491  0.495044
2013-01-03 -0.011139 -1.235460  0.463615 -0.019130
2013-01-04 -1.209340  0.320708 -1.750841  0.288654
2013-01-05  0.510095 -0.840999 -2.061217  0.881860
2013-01-06  0.028280 -2.540471 -0.537396 -0.118283

In [7]:
df.head(100) # get first 2 records, default is 5

                   A         B         C         D
2013-01-01  0.816414  0.241281  1.259946  0.563317
2013-01-02 -1.004928  1.039068 -1.062491  0.495044
2013-01-03 -0.011139 -1.235460  0.463615 -0.019130
2013-01-04 -1.209340  0.320708 -1.750841  0.288654
2013-01-05  0.510095 -0.840999 -2.061217  0.881860
2013-01-06  0.028280 -2.540471 -0.537396 -0.118283

In [8]:
df.tail(2) # get last 2 records, default is 5

                   A         B         C         D
2013-01-05  0.510095 -0.840999 -2.061217  0.881860
2013-01-06  0.028280 -2.540471 -0.537396 -0.118283

In [9]:
df.index # view indexs

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns # view available columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df['B'] # view specific columns

2013-01-01    0.241281
2013-01-02    1.039068
2013-01-03   -1.235460
2013-01-04    0.320708
2013-01-05   -0.840999
2013-01-06   -2.540471
Freq: D, Name: B, dtype: float64

In [12]:
df.describe() # inspect dataset

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.145103 -0.502646 -0.614731  0.348577
std    0.809161  1.297109  1.285829  0.376487
min   -1.209340 -2.540471 -2.061217 -0.118283
25%   -0.756480 -1.136845 -1.578754  0.057816
50%    0.008571 -0.299859 -0.799944  0.391849
75%    0.389641  0.300851  0.213362  0.546248
max    0.816414  1.039068  1.259946  0.881860

In [13]:
df.T # transpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.816414   -1.004928   -0.011139   -1.209340    0.510095    0.028280
B    0.241281    1.039068   -1.235460    0.320708   -0.840999   -2.540471
C    1.259946   -1.062491    0.463615   -1.750841   -2.061217   -0.537396
D    0.563317    0.495044   -0.019130    0.288654    0.881860   -0.118283

In [14]:
df.sort_index(axis=1, ascending=False) # sort by axis

                   D         C         B         A
2013-01-01  0.563317  1.259946  0.241281  0.816414
2013-01-02  0.495044 -1.062491  1.039068 -1.004928
2013-01-03 -0.019130  0.463615 -1.235460 -0.011139
2013-01-04  0.288654 -1.750841  0.320708 -1.209340
2013-01-05  0.881860 -2.061217 -0.840999  0.510095
2013-01-06 -0.118283 -0.537396 -2.540471  0.028280

# ingest excel files

In [15]:
xl = pd.read_excel("./docs/exampleexcel.xlsx")

In [16]:
xl

  Example column 1  Example column 2  Example column three Example column 4
0     Text value 1                 4                   4.6        2019-09-03
1     Text value 2                 5                   5.2        2019-03-05
2     Text value 3                 2                   7.8        2018-05-04
3     Text value 4                 8                   5.9        2017-05-07
4     Text value 5                 9                   3.5        2016-12-09
5     Text value 6                 4                   2.5        2019-02-01
6     Text value 7                 8                   7.8        2019-04-03
7     Text value 8                 0                   9.6        2019-05-02
8     Text value 9                 3                  10.5        2018-02-01

In [17]:
xl.head()

  Example column 1  Example column 2  Example column three Example column 4
0     Text value 1                 4                   4.6        2019-09-03
1     Text value 2                 5                   5.2        2019-03-05
2     Text value 3                 2                   7.8        2018-05-04
3     Text value 4                 8                   5.9        2017-05-07
4     Text value 5                 9                   3.5        2016-12-09

In [18]:
xl['Example column three'].describe()

count     9.000000
mean      6.377778
std       2.727534
min       2.500000
25%       4.600000
50%       5.900000
75%       7.800000
max      10.500000
Name: Example column three, dtype: float64

In [19]:
xl['Example column 2'] = xl['Example column 2'] * 2

In [20]:
xl.head()

  Example column 1  Example column 2  Example column three Example column 4
0     Text value 1                 8                   4.6        2019-09-03
1     Text value 2                10                   5.2        2019-03-05
2     Text value 3                 4                   7.8        2018-05-04
3     Text value 4                16                   5.9        2017-05-07
4     Text value 5                18                   3.5        2016-12-09

# bro log analysis

imngest weird.log

In [21]:
df = pd.read_csv("./docs/weird.log", 
                 sep='\t', 
                 names=['ts', 'uid', 'id.orig_h', 'id.orig_p', 'id.resp_p', 'name', 'addl', 'notice', 'peer'])

In [22]:
df.head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331901e+09,-,-,-,-,-,unknown_protocol_88,-,F,bro
1.331901e+09,-,-,-,-,-,unknown_packet_type,-,F,bro
1.331901e+09,-,-,-,-,-,truncated_IP,-,F,bro
1.331901e+09,CFmfPp4lcYsETNSogj,192.168.202.79,50778,192.168.229.251,80,unescaped_special_URI_char,-,F,bro
1.331901e+09,CiYIRv2E6wmEieDlz3,192.168.202.79,50844,192.168.229.251,80,unescaped_special_URI_char,-,F,bro

In [23]:
df.describe()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
count,65983,65983,65983,65983,65983,65983,65983,65983,65983
unique,51652,222,25773,280,184,50,126,1,1
top,-,192.168.202.102,135,192.168.24.101,80,unescaped_special_URI_char,-,F,bro
freq,457,23765,637,16041,46163,35017,65118,65983,65983

In [24]:
df_clean = df.replace({'-': None}).replace(np.nan, None)
df_clean.head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331901e+09,None,None,None,None,None,unknown_protocol_88,None,F,bro
1.331901e+09,None,None,None,None,None,unknown_packet_type,None,F,bro
1.331901e+09,None,None,None,None,None,truncated_IP,None,F,bro
1.331901e+09,CFmfPp4lcYsETNSogj,192.168.202.79,50778,192.168.229.251,80,unescaped_special_URI_char,None,F,bro
1.331901e+09,CiYIRv2E6wmEieDlz3,192.168.202.79,50844,192.168.229.251,80,unescaped_special_URI_char,None,F,bro

In [25]:
#DataFrame with data types
data_types = pd.DataFrame(df_clean.dtypes, columns=['Data Type'])

#DataFrame with Count
data_count = pd.DataFrame(df_clean.count(), columns=['Count'])

#DataFrame with unique values
unique_value_counts = pd.DataFrame(columns=['Unique Values'])
for v in list(df_clean.columns.values):
    unique_value_counts.loc[v] = [df_clean[v].nunique()]

missing_data_counts = pd.DataFrame(df_clean.isnull().sum(), columns=['Missing Values'])
data_quality_report = data_types.join(data_count).join(unique_value_counts).join(missing_data_counts)
data_quality_report

          Data Type  Count Unique Values  Missing Values
ts           object  65980         51651               3
uid          object  65980           221               3
id.orig_h    object  65980         25772               3
id.orig_p    object  65980           279               3
id.resp_p    object  65980           183               3
name         object  65983            50               0
addl         object  65675           125             308
notice       object  65983             1               0
peer         object  65983             1               0

In [26]:
df_ip = df_clean[df_clean['uid']
                 .where(df_clean['uid'] == '192.168.202.79')
                 .notnull()]

In [27]:
df_ip.describe()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
count,5272,5272,5272,5272,5272,5272,5075,5272,5272
unique,5058,1,4790,76,25,31,12,1,1
top,Co6s3A1W62vxodalN3,192.168.202.79,63195,192.168.229.101,80,bad_HTTP_request,meterpreter,F,bro
freq,4,5272,100,4246,4612,4231,4111,5272,5272

In [28]:
df_ip.head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331901e+09,CFmfPp4lcYsETNSogj,192.168.202.79,50778,192.168.229.251,80,unescaped_special_URI_char,None,F,bro
1.331901e+09,CiYIRv2E6wmEieDlz3,192.168.202.79,50844,192.168.229.251,80,unescaped_special_URI_char,None,F,bro
1.331901e+09,CaASy21dMqj01b3kT5,192.168.202.79,50846,192.168.229.251,80,unescaped_special_URI_char,None,F,bro
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,baroque_SYN,None,F,bro
1.331902e+09,CGa8kzxLafSMHlZsg,192.168.202.79,64051,192.168.229.153,135,baroque_SYN,None,F,bro

In [29]:
df_ip.where(df_ip['id.orig_p'] == '192.168.229.101').head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331901e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.331901e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.331901e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,baroque_SYN,None,F,bro
1.331902e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
df_ip.where(df_ip['id.orig_p'] == '192.168.229.101').dropna(thresh=2).head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,baroque_SYN,None,F,bro
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,premature_connection_reuse,None,F,bro
1.331902e+09,CFxF6t23HHYe8FfM0d,192.168.202.79,64055,192.168.229.101,1,FIN_advanced_last_seq,None,F,bro
1.331902e+09,CCJRLq8IYRnB4hyA,192.168.202.79,59103,192.168.229.101,22,malformed_ssh_identification,None,F,bro
1.331902e+09,CmOhlU5NOif9tNMO2,192.168.202.79,50034,192.168.229.101,80,bad_HTTP_request,None,F,bro

In [41]:
col_1 = 'uid'
col_2 = 'id.orig_p'
ip_1 = '192.168.202.79'
ip_2 = '192.168.229.101'
df_clean[df_clean[col_1]
                 .where(df_clean[col_1] == ip_1)
                 .notnull()].where(df_ip[col_2] == ip_2).dropna(thresh=2).head()

,ts,uid,id.orig_h,id.orig_p,id.resp_p,name,addl,notice,peer
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,baroque_SYN,None,F,bro
1.331902e+09,CQc8bw2Xny9wN0va7d,192.168.202.79,64051,192.168.229.101,22,premature_connection_reuse,None,F,bro
1.331902e+09,CFxF6t23HHYe8FfM0d,192.168.202.79,64055,192.168.229.101,1,FIN_advanced_last_seq,None,F,bro
1.331902e+09,CCJRLq8IYRnB4hyA,192.168.202.79,59103,192.168.229.101,22,malformed_ssh_identification,None,F,bro
1.331902e+09,CmOhlU5NOif9tNMO2,192.168.202.79,50034,192.168.229.101,80,bad_HTTP_request,None,F,bro